//API1NPT  JOB (ACCT#),'ADDNPT',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,TIME=(0,5),
//    COND=(4,LT)
//*
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//*
//COMPCIC  EXEC COMPCICS,NOMPGM=PGM1NPT
//STEPCIC.SYSIN    DD DSN=API1.SOURCE.COBOL(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API1.SOURCE.COPY,DISP=SHR
/*
