000100 01 ITE.
000200     05 ITE-O-NO     PIC 9(03).
000300     05 ITE-P-NO     PIC X(03).
000400     05 ITE-QUANTITY PIC 9(02).
000500     05 ITE-PRICE    PIC 9(03)V9(2).