000100 01 ORD.
000200     05 ORD-O-NO    PIC 9(03).
000300     05 ORD-S-NO    PIC 9(02).
000400     05 ORD-C-NO    PIC 9(04).
000500     05 ORD-O-DATE  PIC X(10).