000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ASSEQX.
000210
000300 DATA DIVISION.
000650
000700 LINKAGE SECTION.
000800 COPY TESTCONT.
000900 01 TEST-NAME PIC X(30).
001000 01 EXPECTED  PIC X(10).
001100 01 ACTUAL    PIC X(10).
001230
001300 PROCEDURE DIVISION USING TEST-CONTEXT
001400                          TEST-NAME
001500                          EXPECTED
001600                          ACTUAL.
001700
001800     ADD 1 TO TESTS-RUN
002300
002600     IF EXPECTED = ACTUAL
002700         ADD 1 TO PASSES
002800     ELSE
002900         DISPLAY 'FAILED : ' TEST-NAME
003000         DISPLAY 'EXPECTED ' EXPECTED
003100         DISPLAY 'ACTUAL   ' ACTUAL
003200         ADD 1 TO FAILURES
003300     END-IF
003400
003500     GOBACK.
