//API2CUNI JOB (ACCT#),'ALEXIS',CLASS=A,MSGCLASS=H,REGION=4M,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID,COND=(4,LT),TIME=(,30)
//* COMPIL CONVDATE POUR LE TEST UNITAIRE
//TESTUNCD  EXEC IGYWCL,PARM.COBOL=(NODYNAM,ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=API2.COB.SRC(TESTUNCD),DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//             DD DSN=API2.COB.CPY,DISP=SHR
//* LINKEDIT
//LKED.SYSLMOD DD DSN=API2.COB.LOAD(TESTUNCD),DISP=SHR
//LKED.SYSLIB  DD DSN=API2.COB.LOAD,DISP=SHR
//LKED.SYSIN   DD *
 NAME TESTUNCD(R)
/*
