//API2EUNI JOB (ACCT#),'ALEXIS',CLASS=A,MSGCLASS=H,REGION=4M,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID,COND=(4,LT),TIME=(,30)
//*
//       SET SYSUID=API2,
//           NOMPGM=TESTUNCD
//* RUN TESTUNCD POUR LE TEST UNITAIRE
//RTESTUN  EXEC PGM=&NOMPGM,COND=(4,LT)
//*STEPLIB    DD DSN=&SYSUID..SOURCE.PGMLIB,DISP=SHR
//STEPLIB    DD DSN=&SYSUID..COB.LOAD,DISP=SHR
//SYSOUT     DD SYSOUT=*,OUTLIM=4000
//SYSTSPRT   DD SYSOUT=*,OUTLIM=25000
//SYSIN      DD DUMMY
