000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TESTUNCD.
000210
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-DATE-FR     PIC X(10) VALUE '10/10/2022'.
000510 01 WS-DATE-US     PIC X(10) VALUE '10/10/2022'.
000600 01 WS-FORMAT      PIC X(02).
000700 01 SEPARATOR      PIC X VALUE SPACE.
000710
000800 PROCEDURE DIVISION.
000900     DISPLAY '==== DEBUT TEST CONVDATE ===='
000910
000920* TEST 1 : FORMAT FR
000930     MOVE 'FR' TO WS-FORMAT
001000     CALL 'CONVDATE' USING WS-DATE-FR, WS-FORMAT
001010     DISPLAY 'TEST FORMAT FR'
001100     DISPLAY 'DATE EN ENTREE : 10/10/2022'
001300     DISPLAY 'DATE CONVERTIE : ' WS-DATE-FR
001400
001500* TEST 2 : FORMAT US
001510     MOVE 'US' TO WS-FORMAT
001520     CALL 'CONVDATE' USING WS-DATE-US, WS-FORMAT
001530     DISPLAY 'TEST FORMAT US'
001540     DISPLAY 'DATE EN ENTREE : 10/10/2022'
001550     DISPLAY 'DATE CONVERTIE : ' WS-DATE-US
001600
001700     DISPLAY '==== FIN TEST CONVDATE ===='
001800
001900     STOP RUN.
