      ***************************************************************
      *  DESCRIPTION D'UN ENREGISTREMENT EMPLOYEE                   *
      ***************************************************************
       01 ENR-EMP.
          05 CD-EMP    PIC X(5).
          05 NOM-EMP   PIC X(15).
          05 PREN-EMP  PIC X(15).
          05 CP-EMP    PIC X(5).
          05 VILLE-EMP PIC X(20).
          05 SAL-EMP   PIC 9(5)V99.
          02 FILLER    PIC XXX.
