000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CONVDATE.
000300
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SPECIAL-NAMES.
001200     DECIMAL-POINT IS COMMA.
001300 DATA DIVISION.
001400 WORKING-STORAGE SECTION.
001500
001600 01 WS-DATE-US.
001700     05 US-AA    PIC X(4).
001800     05 FILLER   PIC X(1)     VALUE  '/'.
001900     05 US-MM    PIC X(2).
002000     05 FILLER   PIC X(1)     VALUE  '/'.
002100     05 US-JJ    PIC X(2).
002200
002300 01 WS-DATE-FR.
002400     05 FR-JJ    PIC X(2).
002500     05 FILLER   PIC X(1)     VALUE  '/'.
002600     05 FR-MM    PIC X(2).
002700     05 FILLER   PIC X(1)     VALUE  '/'.
002800     05 FR-AA    PIC X(4).
002900
003000 01 ED-JJ      PIC Z9.
003100 01 TMP-DATE   PIC X(30).
003200 77 WS-ANO     PIC 9 VALUE 0.
003300 77 WS-DATE    PIC X(10).
003400
003500 LINKAGE SECTION.
003600 01 LS-DATE      PIC X(10).
003700 01 LS-FORMAT    PIC X(02).
003800
003900 PROCEDURE DIVISION USING LS-DATE, LS-FORMAT.
004000     EVALUATE TRUE
004100         WHEN LS-FORMAT = 'US'
004200             PERFORM USA-DATE
004300         WHEN LS-FORMAT = 'FR'
004400             PERFORM EUROPA-DATE
004500         WHEN OTHER
004600             DISPLAY 'INVALID DATE FORMAT - U MARTIAN ? '
004700     END-EVALUATE
004800
004900     GOBACK.
005000
005100 USA-DATE.
005200     UNSTRING LS-DATE DELIMITED BY '/'
005300         INTO US-JJ US-MM US-AA
005400     END-UNSTRING
005500
005600     INITIALIZE LS-DATE
005700         STRING US-AA    DELIMITED BY SIZE
005800             '-'         DELIMITED BY SIZE
005900             US-MM       DELIMITED BY SIZE
006000             '-'         DELIMITED BY SIZE
006100             US-JJ       DELIMITED BY SIZE
006200         INTO LS-DATE.
006300
006400 EUROPA-DATE.
006500     UNSTRING LS-DATE DELIMITED BY '/'
006600         INTO FR-JJ FR-MM FR-AA
006700     END-UNSTRING
006800
006900     INITIALIZE LS-DATE
007000         STRING FR-JJ  DELIMITED BY SIZE
007100             '-'       DELIMITED BY SIZE
007200             FR-MM     DELIMITED BY SIZE
007300             '-'       DELIMITED BY SIZE
007400             FR-AA     DELIMITED BY SIZE
007500         INTO LS-DATE.
