      ***************************************************************
      *  DESCRIPTION D'UN ENREGISTREMENT NEWPARTS                   *
      ***************************************************************
       01 ENR-NPT.
          05 PNO-NPT      PIC X(2).
          05 PNAME-NPT    PIC X(30).
          05 COLOR-NPT    PIC X(20).
          05 WEIGHT-NPT   PIC S9(2)V  COMP-3.
          05 CITY-NPT     PIC X(20).
          05 FILLER       PIC X(6).
