      ***************************************************************
      *  DESCRIPTION D'UNE LIGNE VIDE DE LA FACTURE                 *
      ***************************************************************
             10 FILLER PIC X VALUE '|'.
             10 FILLER PIC X(76) VALUE ALL SPACES.
             10 FILLER PIC X VALUE '|'.
