       01 ZONE.
          05 COMMA-PGM     PIC X(8).
          05 PREV-PGM      PIC X(8).
          05 FILLER        PIC X(4).
          05 INFOS         PIC X(49).
          05 FILLER        PIC 9.
             88 NOT-LOGGED VALUE 0.
             88 LOGGED     VALUE 1.
